# =======================================================================
# ===== Дан текстовый файл. Удалить из него последнюю строку.============
# ================ Результат записать в другой файл. ====================
# =======================================================================

with open("text1.txt", "r", encoding="utf8") as file:
    text = file.readlines()
text.remove(text[-1])

with open("task3_res.txt.txt", "a", encoding="utf8") as file:
    for i in text:
        file.write(f"{i}")
