# =======================================================================
# ======= Дан текстовый файл. Найти и заменить в нем заданное слово. ====
# =======Что искать и на что заменять определяется пользователем.========
# =======================================================================

with open("text2.txt", "r", encoding="utf8") as file:
    text = file.read()

text = text.replace(input("Найти слово: "), input("Заменить слово на: "))

with open("task_6.txt", "w", encoding="utf8") as file:
    file.writelines(text)
